1. Attendance Data

    Read the data from the `attendance` table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.
    
    You should end up with something like this:

        name
        Billy    0.5250
        Jane     0.6875
        John     0.9125
        Sally    0.7625
        Name: grade, dtype: float64

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats
from env import get_connection

In [2]:
df = pd.read_sql('SELECT * FROM attendance', get_connection('tidy_data'))
df.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [3]:
df.rename(columns={'Unnamed: 0':'Name'}, inplace=True)

In [4]:
working_df = df.melt(id_vars='Name', var_name= 'Date', value_name = 'Attendance')

In [9]:
working_df.head()

    Name        Date Attendance  days_absent
0  Sally  2018-01-01          P          0.0
1   Jane  2018-01-01          A          1.0
2  Billy  2018-01-01          A          1.0
3   John  2018-01-01          P          0.0
4  Sally  2018-01-02          T          0.1

In [6]:
missed_values = {'H':0.5,'P':0.0,'T':0.1,'A':1.0}

In [7]:
working_df['days_absent'] = working_df['Attendance'].map(missed_values)
working_df.head()

    Name        Date Attendance  days_absent
0  Sally  2018-01-01          P          0.0
1   Jane  2018-01-01          A          1.0
2  Billy  2018-01-01          A          1.0
3   John  2018-01-01          P          0.0
4  Sally  2018-01-02          T          0.1

In [23]:
working_df.drop(columns=['Date', 'Attendance'], inplace=True)

In [24]:
final_df = working_df.groupby(['Name']).sum()

In [25]:
final_df

       days_absent
Name
Billy          3.8
Jane           2.5
John           0.7
Sally          1.9